Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/care_in_your_community/chiropody_services.html.txt.tmx
Source language: en
Languages: ga

source: Chiropodists/podiatrists assess, diagnose and treat diseases and abnormalities of the foot and lower limb
ga: Déanann coslia measúnú, diagnóis agus cóireáil ar ghalair agus éalang a bhaineann leis an gcos

source: The term 'podiatrist' is now replacing the term 'chiropodist'
ga: Is féidir le cosliacht feabhas suntasach a chur ar chaighdeán saoil daoine trí phian a mhaolú agus soghluaisteacht a chur chun cinn agus a chothú

source: Podiatry can significantly improve peoples’ quality of life by alleviating painful symptoms, and promoting and maintaining mobility
ga: Sa Bhéarla, tá an téarma ‘podiatrist’ ag teacht isteach anois in áit an téarma ‘chiropodist’

source: The Health Service Executive (HSE) is not legally obliged to provide chiropody/podiatry services but where they do, services may be provided by the Local Health Office or by voluntary organisations on behalf of the HSE
ga: Níl aon dualgas dlíthiúil ar Fheidhmeannacht na Seirbhísí Sláinte (FSS)seirbhísí cosliachta a chur ar fáil ach sa chás go ndéanann siad é sin, d’fhéadfadh seirbhísí a bheith á gcur ar fáil ag an Oifig Sláinte Áitiúil nó ag eagraíochtaí deonacha thar ceann FSS

source: Where the service is available, it is free to medical card holders and people with Hepatitis C who contracted the disease through the use of Human Immunoglobulin-Anti-D or from the receipt within Ireland of any blood product or a blood transfusion and who have a Health Amendment Act Card
ga: Sa chás go bhfuil an tseirbhís ar fáil, is seirbhís í atá saor in aisce i gcás daoine a bhfuil cártaí leighis acu agus daoine a tholg Heipitíteas C go díreach nó go hindíreach as glóbailin imdhíonachta frith-D daonna a úsáid nó as aon táirge fola nó aistriú fola a fuarthas in Éirinn agus a bhfuil Cárta faoin Acht Sláinte Leasaithe acu

source: Tax relief and chiropody services
ga: Faoiseamh cánach agus seirbhísí cosliachta

source: Non-medical card holders may be able to claim tax relief on chiropody services if you are required to attend as part of medical treatment
ga: D’fhéadfadh sé go mbeadh daoine nach bhfuil cártaí leighis acu ábalta faoiseamh cánach a éileamh ar sheirbhísí cosliachta má tá orthu freastal ar na seirbhísí sin mar chuid de chóir leighis

source: (That is, you have a significant disability or a serious illness, etc
ga: (Is é sin, má tá míchumas suntasach nó tinneas tromchúiseach srl

source: and your doctor directs you attend chiropody services)
ga: ort, agus go n-ordaíonn do dhochtúir duit freastal ar sheirbhísí cosliachta)

source: You may also be able to claim tax relief on any doctors visits and prescription drugs associated with this care. See our information on tax relief for medical expenses for further details
ga: D’fhéadfadh sé go mbeifeá ábalta faoiseamh cánach a éileamh ar chostais sláinte ar aon chuairt dochtúra agus ar chógais ar oideas a bhaineann leis an gcúram seo freisin

source: Coru, the Health and Social Care Professionals Council is the organisation that will register and regulate chiropodists/podiatrists
ga: Is iad Coru, Comhairle na nGairmithe Sláinte agus Cúraim Shóisialta an eagraíocht a dhéanfaidh coslianna a chlárú agus a rialú

source: Coru is currently putting in place the foundation for the establishment of the registers and the professional standards for groups covered by the Health and Social Care Professionals Act 2005
ga: Tá an bunús do bhunú na gclár agus na gcaighdeán gairmiúil do ghrúpaí arna gclúdach ag an Acht um Ghairmithe Sláinte agus Cúraim Shóisialaigh 2005 á chur le chéile ag Coru i láthair na huaire

source: Read more about registration of social care professionals here
ga: Léigh tuilleadh faoi chlárú na ngairmithe cúraim shóisialaigh anseo

source: There are currently 3 separate professional bodies representing chiropodists/podiatrists:
ga: Tá trí chomhlacht gairmiúil ar leith ag déanamh ionadaíocht ar choslianna faoi láthair:

source: • The Society of Chiropodists and Podiatrists of Ireland
ga: • Cumann Coslianna na hÉireann

source: You can contact them if you want more information about chiropody or wish to check whether your practitioner is a registered member
ga: Is féidir leat dul i dteagmháil leo má theastaíonn tuilleadh eolais uait faoi chosliacht nó más mian leat a sheiceáil an ball cláraithe é / í do chleachtóir

source: Chiropody services provided by the HSE vary but usually they give priority to the following groups:
ga: Bíonn éagsúlachtaí idir na seirbhísí cosliachta atá á gcur ar fáil ag FSS, ach is iondúil go dtugann siad tús áite do na grúpaí seo a leanas:

source: • Medical card holders who are aged 66 and over
ga: • Sealbhóirí cártaí leighis atá 66 bliain d’aois nó os a chionn

source: • People who have contracted Hepatitis C directly or indirectly from the use of Human Immunoglobulin-Anti-D or from the receipt within Ireland of any blood product or a blood transfusion and who have Health Amendment Act Cards
ga: • Daoine a tholg Heipitíteas C go díreach nó go hindíreach as glóbailin imdhíonachta frith-D daonna a úsáid nó as aon táirge fola nó aistriú fola a fuarthas in Éirinn agus a bhfuil cártaí faoin Acht Sláinte Leasaithe acu

source: • People who have illnesses such as diabetes or arthritis
ga: • Daoine ar a bhfuil tinnis cosúil le diaibéiteas nó airtríteas

source: The service is usually provided at health centres or HSE clinics
ga: Cuirtear an tseirbhís ar fáil de ghnáth ag ionaid sláinte nó ag clinicí FSS

source: In exceptional circumstances, it may be possible to get a chiropody service at home
ga: I gcúinsí eisceachtúla, d’fhéadfadh sé tarlú go mbeadh seirbhís cosliachta ar fáil ag baile

source: Normally you are referred for chiropody services by your GP or public health nurse
ga: Is iondúil go n-atreoraíonn do dhochtúir teaghlaigh (DG) nó d’altra sláinte poiblí tú i gcomhair seirbhísí cosliachta

source: You may also contact chiropodists/podiatrists directly, but you cannot claim tax relief unless the treatment is directed by a GP or hospital as part of your medical care
ga: Is féidir leat dul i dteagmháil le coslianna go díreach freisin, ach ní féidir leat faoiseamh cánach a éileamh ach amháin má thugann DG nó ospidéal treoir go bhfuil cóireáil le cur ort mar chuid de do chúram leighis

source: See our information on tax relief on medical expenses for details of how to apply
ga: Cá háit a ndéanfaidh mé iarratas

source: Contact your GP or public health nurse for information on chiropody services in your area
ga: Faisnéis teagmhála dod’ oifig cánach áitiúil i gcomhair éileamh maidir le Faoiseamh cánach ar chostais leighis
